brew 'zsh'
brew 'direnv'

brew 'bat'          # Output highlighting (better cat)
brew 'duf'          # Get info on mounted disks (better df)
brew 'exiftool'     # Read, write and modify exif data
brew 'ctop'         # Container metrics and monitoring
brew 'btop'       # Resource monitoring (like htop)
brew 'dua-cli'      # Disk usage analyzer and monitor (better du)
brew 'speedtest-cli'# Command line speed test utility
brew 'lazydocker'   # Full Docker management app
brew 'lazygit'      # Full Git managemtne app
brew 'navi'         # Browse, search, read cheat sheets
brew 'cowsay'       # Have an ASCII cow say your message
brew 'figlet'       # Output text as big ASCII art text
brew 'lolcat'       # Make console output raibow colored
brew 'ripgrep'      # Better grep
brew 'ranger'       # Directory browser
brew 'gnu-sed'      # gsed (needed for spectre nvim)
brew 'jq'
brew 'dive'
brew 'fd'
brew 'fzf'

brew 'eza'          # Better ls
brew 'fd'           # Better find
brew 'tldr'         # Better man
brew 'zoxide'       # Better cd (the z command)

# brew 'tmux'
# brew 'zellij'

brew 'gh'
brew 'git-revise'
brew 'git-lfs'

# Nerd font
# see also ~/.config/kitty/nerd-font-symbols.conf for more info
cask 'font-symbols-only-nerd-font'
# cask 'font-meslo-lg-nerd-font'

# Yabai and Skhd
# tap 'koekeishiya/formulae'
# brew 'koekeishiya/formulae/yabai'
# brew 'koekeishiya/formulae/skhd'

# Bun 🧅
tap 'oven-sh/bun'
brew 'bun'

brew 'go'
brew 'zig'

# Cross compilation for Rust
brew 'SergioBenitez/osxct/x86_64-unknown-linux-gnu'
brew 'FiloSottile/musl-cross/musl-cross'

# Others
brew 'direnv'
brew 'ffmpeg'
brew 'neovim'
brew 'python@3'
brew 'yt-dlp'
brew 'sops'
brew 'nmap'

# Expo iOS dev
brew 'rbenv'
brew 'swiftlint'
brew 'sourcekitten'
# should be theoretically installed by Ruby but not always
brew 'cocoapods'

# SSL/TLS that I don't understand but stuff often doesn't work without it
brew 'ca-certificates'

# AI slop
brew 'claude-code'
brew 'gemini-cli'

