
brew 'bat'          # Output highlighting (better cat)
brew 'duf'          # Get info on mounted disks (better df)
brew 'exiftool'     # Read, write and modify exif data
brew 'ctop'         # Container metrics and monitoring
brew 'bpytop'       # Resource monitoring (like htop)
brew 'dua-cli'      # Disk usage analyzer and monitor (better du)
brew 'speedtest-cli'# Command line speed test utility
brew 'lazydocker'   # Full Docker management app
brew 'lazygit'      # Full Git managemtne app
brew 'navi'         # Browse, search, read cheat sheets
brew 'cowsay'       # Have an ASCII cow say your message
brew 'figlet'       # Output text as big ASCII art text
brew 'lolcat'       # Make console output raibow colored
brew 'ripgrep'      # Better grep
brew 'ranger'       # Directory browser
brew 'gnu-sed'      # gsed (needed for spectre nvim)

brew 'exa'          # Better ls
brew 'fd'           # Better find
brew 'tldr'         # Better man
brew 'zoxide'       # Better cd (the z command)

brew 'tmux'

# Nerd font
tap 'homebrew/cask-fonts'
# Version 3.0 broke fonts, use 2.3.3
cask 'https://raw.githubusercontent.com/Homebrew/homebrew-cask-fonts/c6f6dbdf5da109fdcc01d86703bd7d64329f143d/Casks/font-symbols-only-nerd-font.rb'
# cask 'font-meslo-lg-nerd-font'
# cask 'font-symbols-only-nerd-font'

